#+title: Random_notes

**** Arguments

#+BEGIN_SRC sh :eval no :tangle ./tg/s001_id.sh :shebang "#!/bin/bash" :comments no

echo "Nazwa skryptu: $0"
echo "Podales $# argumentow"
echo "Oto one: $*"
echo "Argument 1 = $1"
echo "Argument 2 = $2"

#+END_SRC

#+BEGIN_SRC sh

echo " "
echo $@
echo " "
echo $*

#+END_SRC

Źródło: http://www.is.umk.pl/~grochu/unix/materialy/unix.pdf

#+BEGIN_SRC sh :eval yes :tangle no :comments no :results drawer

bash ./tg/s001_id.sh pierwszy drugi trzeci czwarty

#+END_SRC

#+RESULTS:
:RESULTS:
Nazwa skryptu=./tg/s001_id.sh
Podales 4 argumentow
Oto one: pierwszy drugi trzeci czwarty
Argument 1 = pierwszy
Argument 2 = drugi
:END:

